tests/fixtures/vllm_bench_stdout_sample.txt
================ Serving Benchmark Result ================
Successful requests:                     32        
Failed requests:                         0         
Benchmark duration (s):                  45.32     
Total input tokens:                      16384     
Total generated tokens:                  2048      
Request throughput (req/s):              0.71      
Output token throughput (tok/s):         76.57     
Peak output token throughput (tok/s):    84.32     
Peak concurrent requests:                8         
Total token throughput (tok/s):          145.21    
----------------Time to First Token----------------
Mean TTFT (ms):                          128.45    
Median TTFT (ms):                        96.32     
P99 TTFT (ms):                           312.18    
-----Time per Output Token (excl. 1st token)-----
Mean TPOT (ms):                          13.06     
Median TPOT (ms):                        12.91